РасширениеГТС/Джитиис/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютнаяОтгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютныйСчетВРубли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

РасширениеГТС/Джитиис/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ASP_ВидКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ASP_ВидыКП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказКлиента/Ext/ManagerModule.bsl
&ИзменениеИКонтроль("СформироватьКомплектПечатныхФорм")
Функция асп_СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати)

	Перем АдресКомплектаПечатныхФорм;

	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("АдресКомплектаПечатныхФорм", АдресКомплектаПечатныхФорм) Тогда

		КомплектПечатныхФорм = ПолучитьИзВременногоХранилища(АдресКомплектаПечатныхФорм);

	Иначе

		КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.КомплектПечатныхФорм(
		Метаданные.Документы.ЗаказКлиента.ПолноеИмя(),
		МассивОбъектов, Неопределено);

	КонецЕсли;

	Если КомплектПечатныхФорм = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ЗаказКлиента");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьЗаказовНаТоварыУслуги.СформироватьПечатнуюФормуЗаказаКлиента(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ЗаказКлиентаБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьЗаказовНаТоварыУслуги.СформироватьПечатнуюФормуЗаказаКлиента(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплату");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуСФаксимиле");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	ПараметрыПечати.Вставить("ОтображатьФаксимиле", Истина);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуСФаксимилеБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	ПараметрыПечати.Вставить("ОтображатьФаксимиле", Истина);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ProformaInvoiceEn");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуProformaInvoice(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	РегистрыСведений.НастройкиПечатиОбъектов.СформироватьКомплектВнешнихПечатныхФорм(
	"Документ.ЗаказКлиента",
	МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати);
#Удаление

#КонецУдаления
#Вставка

	#Область ASP_Mental
//2018-11-13 
	//ASP_Dante 05/09/19 Все печати переделал на типовой функционал 
	//отрабатывал не корректно и печатался не верно
	//ИмяМакета = "СчетНаОплатуГТС";
	//ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));
	//Если ТекущийКомплект.Количество() > 0 Тогда
	//	Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
	//		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КоллекцияПечатныхФорм, ИмяМакета, ИмяМакета, 1);
	//		ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
	//		ТаблицаСсылок.Свернуть("Ссылка");
	//		ТекущаяСтруктураТипов = Новый Соответствие;
	//		ТекущаяСтруктураТипов.Вставить("Документ.ЗаказКлиента", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
	//	Иначе
	//		РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
	//		ТекущаяСтруктураТипов = СтруктураТипов;
	//	КонецЕсли;
	//			
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//	КоллекцияПечатныхФорм,
	//	ИмяМакета,
	//	ТекущийКомплект[0].Представление,
	//	Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплатуГТС(ТекущаяСтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	//КонецЕсли;
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
		КомплектПечатныхФорм,
		МассивОбъектов,
		"СчетНаОплатуГТС");
	//ПараметрыПечати.Вставить("ИмяФормы", "ЗаданиеНаОтбор");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			КомплектПечати.Имя,
			КомплектПечати.Представление,
			Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплатуГТС(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	
	//ИмяМакета = "СчетНаОплатуГТСБезСкидок";
	//ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));
	//Если ТекущийКомплект.Количество() > 0 Тогда
	//	Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
	//		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КоллекцияПечатныхФорм, ИмяМакета, ИмяМакета, 1);//ASP_Dante 05/09/19СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета);
	//		ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
	//		ТаблицаСсылок.Свернуть("Ссылка");
	//		ТекущаяСтруктураТипов = Новый Соответствие;
	//		ТекущаяСтруктураТипов.Вставить("Документ.ЗаказКлиента", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
	//	Иначе
	//		РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
	//		ТекущаяСтруктураТипов = СтруктураТипов;
	//	КонецЕсли;
	//	
	//	ПараметрыПечати.Вставить("ВыводитьСкидки", Ложь);
	//	
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//	КоллекцияПечатныхФорм,
	//	ИмяМакета,
	//	ТекущийКомплект[0].Представление,
	//	Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплатуГТС(ТекущаяСтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	//КонецЕсли;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
		КомплектПечатныхФорм,
		МассивОбъектов,
		"СчетНаОплатуГТСБезСкидок");
	//ПараметрыПечати.Вставить("ИмяФормы", "ЗаданиеНаОтбор");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
		ПараметрыПечати.Вставить("ВыводитьСкидки", Ложь);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			КомплектПечати.Имя,
			КомплектПечати.Представление,
			Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплатуГТС(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
		
	//ИмяМакета = "УПД1";
	//ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));	
	//Если ТекущийКомплект.Количество() > 0 Тогда
		МассивДокументов = Новый Массив;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |ГДЕ
		               |	РеализацияТоваровУслуг.ЗаказКлиента.Ссылка В(&ЗаказКлиента)
		               |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ" ;
		Запрос.УстановитьПараметр("ЗаказКлиента", МассивОбъектов); 
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДокументов.Вставить(0, Выборка.Ссылка);
		КонецЦикла;
		Если МассивДокументов.Количество() <> 0 Тогда		
			//	Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			//		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КоллекцияПечатныхФорм, ИмяМакета, ИмяМакета, 1);//ASP_Dante 05/09/19СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			//		ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
			//		ТаблицаСсылок.Свернуть("Ссылка");
			//		ТекущаяСтруктураТипов = Новый Соответствие;
			//		ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
			//	Иначе
			//		РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			//		СтруктураТипов = Новый Соответствие;
			//		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
			//		ТекущаяСтруктураТипов = СтруктураТипов;
			//	КонецЕсли;
			//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			//		КоллекцияПечатныхФорм,
			//		ИмяМакета,
			//		ТекущийКомплект[0].Представление,
			//		Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуУПД(ТекущаяСтруктураТипов, ОбъектыПечати, Неопределено, ТекущийКомплект));
			КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
					КомплектПечатныхФорм,
					МассивОбъектов,
					"УПД1");
			//ПараметрыПечати.Вставить("ИмяФормы", "ЗаданиеНаОтбор");
			Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
				СтруктураТипов = Новый Соответствие;
				//СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
				СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				КомплектПечати.Имя,
				КомплектПечати.Представление,
				Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуУПД(СтруктураТипов,  ОбъектыПечати, Неопределено));
			КонецЦикла;
		Иначе Сообщить("Для документа " + МассивОбъектов[0] + " не создана реализация! Печать УПД невозможна!");
		КонецЕсли;	
	//КонецЕсли;
		
	//ИмяМакета = "ТТН";
	//ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));	
	//Если ТекущийКомплект.Количество() > 0 Тогда
	//	МассивДокументов = Новый Массив;
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	РеализацияТоваровУслуг.Ссылка
	//	               |ИЗ
	//	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	               |ГДЕ
	//	               |	РеализацияТоваровУслуг.ЗаказКлиента.Ссылка В(&ЗаказКлиента)" ;
	//	Запрос.УстановитьПараметр("ЗаказКлиента", МассивОбъектов); 
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		МассивДокументов.Вставить(0, Выборка.Ссылка);
	//	КонецЦикла;
		Если МассивДокументов.Количество() <> 0 Тогда		
		//Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
		//	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КоллекцияПечатныхФорм, ИмяМакета, ИмяМакета, 1);//ASP_Dante 05/09/19СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
		//	ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
		//	ТаблицаСсылок.Свернуть("Ссылка");
		//	ТекущаяСтруктураТипов = Новый Соответствие;
		//	ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
		//Иначе
		//	РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
		//	СтруктураТипов = Новый Соответствие;
		//	СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
		//	ТекущаяСтруктураТипов = СтруктураТипов;
		//КонецЕсли;
		//
		//
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//	КоллекцияПечатныхФорм,
		//	ИмяМакета,
		//	ТекущийКомплект[0].Представление,
		//	Обработки.ПечатьТТН.СформироватьПечатнуюФормуТТН(МассивДокументов, ОбъектыПечати, ПараметрыПечати, ТекущийКомплект));
			КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
					КомплектПечатныхФорм,
					МассивОбъектов,
					"ТТН");
			//ПараметрыПечати.Вставить("ИмяФормы", "ЗаданиеНаОтбор");
			Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
				//СтруктураТипов = Новый Соответствие;
				//СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
				//СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				КомплектПечати.Имя,
				КомплектПечати.Представление,
				Документы.ТранспортнаяНакладная.СформироватьПечатнуюФормуТТН(МассивДокументов, ОбъектыПечати, ПараметрыПечати));
			КонецЦикла;
		Иначе Сообщить("Для документа " + МассивОбъектов[0] + " не создана реализация! Печать товарно-транспортной накладной невозможна!");	
		КонецЕсли;	
	//КонецЕсли;
		
	//ИмяМакета = "ТранспортнаяНакладная";	
	//ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));	
	//Если ТекущийКомплект.Количество() > 0 Тогда
	//	МассивДокументов = Новый Массив;
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	РеализацияТоваровУслуг.Ссылка
	//	               |ИЗ
	//	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	               |ГДЕ
	//	               |	РеализацияТоваровУслуг.ЗаказКлиента.Ссылка В(&ЗаказКлиента)" ;
	//	Запрос.УстановитьПараметр("ЗаказКлиента", МассивОбъектов); 
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		МассивДокументов.Вставить(0, Выборка.Ссылка);
	//	КонецЦикла;
		
		Если МассивДокументов.Количество() <> 0 Тогда
		//Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
		//	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КоллекцияПечатныхФорм, ИмяМакета, ИмяМакета, 1);//ASP_Dante 05/09/19СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
		//	ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
		//	ТаблицаСсылок.Свернуть("Ссылка");
		//	ТекущаяСтруктураТипов = Новый Соответствие;
		//	ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
		//Иначе
		//	РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
		//	СтруктураТипов = Новый Соответствие;
		//	СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
		//	ТекущаяСтруктураТипов = СтруктураТипов;
		//КонецЕсли;
		//
		//
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//	КоллекцияПечатныхФорм,
		//	ИмяМакета,
		//	ТекущийКомплект[0].Представление,
		//	Обработки.ПечатьТранспортнойНакладной.СформироватьПечатнуюФормуТранспортнойНакладной(МассивДокументов, ОбъектыПечати, ТекущийКомплект));
			КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
					КомплектПечатныхФорм,
					МассивОбъектов,
					"ТранспортнаяНакладная");
			//ПараметрыПечати.Вставить("ИмяФормы", "ЗаданиеНаОтбор");
			Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
				//СтруктураТипов = Новый Соответствие;
				//СтруктураТипов.Вставить("Документ.ЗаказКлиента", КомплектПечати.Объекты);
				//СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов)
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				КомплектПечати.Имя,
				КомплектПечати.Представление,
				Документы.ТранспортнаяНакладная.СформироватьПечатнуюФормуТранспортнойНакладной(МассивДокументов, ОбъектыПечати, КомплектПечати));
			КонецЦикла;
		Иначе Сообщить("Для документа " + МассивОбъектов[0] + " не создана реализация! Печать транспортной накладной невозможна!");
		КонецЕсли;	
	//КонецЕсли;	
	
	//ИмяМакета = "РасходнаяНакладнаяСГТД";	
	//ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));	
	//Если ТекущийКомплект.Количество() > 0 Тогда
	//	МассивДокументов = Новый Массив;
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	РеализацияТоваровУслуг.Ссылка
	//	               |ИЗ
	//	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	               |ГДЕ
	//	               |	РеализацияТоваровУслуг.ЗаказКлиента.Ссылка В(&ЗаказКлиента)" ;
	//	Запрос.УстановитьПараметр("ЗаказКлиента", МассивОбъектов); 
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		МассивДокументов.Вставить(0, Выборка.Ссылка);
	//	КонецЦикла;
	//	
		Если МассивДокументов.Количество() <> 0 Тогда
		//Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
		//	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КоллекцияПечатныхФорм, ИмяМакета, ИмяМакета, 1);//ASP_Dante 05/09/19СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
		//	ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
		//	ТаблицаСсылок.Свернуть("Ссылка");
		//	ТекущаяСтруктураТипов = Новый Соответствие;
		//	ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
		//Иначе
		//	РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
		//	СтруктураТипов = Новый Соответствие;
		//	СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
		//	ТекущаяСтруктураТипов = СтруктураТипов;
		//КонецЕсли;
		//ВывестиКомплектующие = Ложь;
		//ВывестиГТД = Истина;
		//		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, ТекущийКомплект[0].Представление, 
		//Документы.РеализацияТоваровУслуг.СформироватьПечатнуюФормуНакладная(МассивДокументов, ОбъектыПечати, ВывестиКомплектующие , ВывестиГТД));
		КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
					КомплектПечатныхФорм,
					МассивОбъектов,
					"РасходнаяНакладнаяСГТД");
			//ПараметрыПечати.Вставить("ИмяФормы", "ЗаданиеНаОтбор");
			Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
				ВывестиКомплектующие = Ложь;
				ВывестиГТД = Истина;
				ВывестиКомплектовочныйЛист=Ложь;
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				КомплектПечати.Имя,
				КомплектПечати.Представление,
				Документы.РеализацияТоваровУслуг.Аль_СформироватьПечатнуюФормуНакладная(МассивДокументов, ОбъектыПечати, ВывестиКомплектующие , ВывестиГТД, ВывестиКомплектовочныйЛист));
			КонецЦикла;
		Иначе Сообщить("Для документа "+ МассивОбъектов[0] + " не создана реализация! Печать расходной накладной с ГТД невозможна!");
		КонецЕсли;
	//КонецЕсли;

	//ИмяМакета = "РасходнаяНакладнаяСКомплектующими";	
	//ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));	
	//Если ТекущийКомплект.Количество() > 0 Тогда
	//	МассивДокументов = Новый Массив;
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	РеализацияТоваровУслуг.Ссылка
	//	               |ИЗ
	//	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	               |ГДЕ
	//	               |	РеализацияТоваровУслуг.ЗаказКлиента.Ссылка В(&ЗаказКлиента)" ;
	//	Запрос.УстановитьПараметр("ЗаказКлиента", МассивОбъектов); 
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		МассивДокументов.Вставить(0, Выборка.Ссылка);
	//	КонецЦикла;
		Если МассивДокументов.Количество() <> 0 Тогда 		
		//Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
		//	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КоллекцияПечатныхФорм, ИмяМакета, ИмяМакета, 1);//ASP_Dante 05/09/19СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
		//	ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
		//	ТаблицаСсылок.Свернуть("Ссылка");
		//	ТекущаяСтруктураТипов = Новый Соответствие;
		//	ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
		//Иначе
		//	РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
		//	СтруктураТипов = Новый Соответствие;
		//	СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивДокументов);
		//	ТекущаяСтруктураТипов = СтруктураТипов;
		//КонецЕсли;
		//ВывестиКомплектующие = Истина;
		//ВывестиГТД = Ложь;
		//
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, ТекущийКомплект[0].Представление, 
		//Документы.РеализацияТоваровУслуг.СформироватьПечатнуюФормуНакладная(МассивДокументов, ОбъектыПечати, ВывестиКомплектующие , ВывестиГТД));
		КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
					КомплектПечатныхФорм,
					МассивОбъектов,
					"РасходнаяНакладнаяСКомплектующими");
			//ПараметрыПечати.Вставить("ИмяФормы", "ЗаданиеНаОтбор");
			Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
				ВывестиКомплектующие = Истина;
				ВывестиГТД = Ложь;
				ВывестиКомплектовочныйЛист=Ложь; 
				
				//++ ASP_Спиряева 27.02.2025 000026255 Добавила вторую форму для РасходнаяНакладнаяСКомплектующими если есть ОтгрузкаБезДокументов  
				ИтоговыйТабДокумент	= Документы.РеализацияТоваровУслуг.СформироватьПечатнуюФормуНакладная(МассивДокументов, ОбъектыПечати, ВывестиКомплектующие , ВывестиГТД, ВывестиКомплектовочныйЛист);
				//Проверяем, есть ли объекты для второй формы  000026255
				МассивОбъектовОтгрузкаБезДок = Документы.РеализацияТоваровУслуг.ПроверитьДокументыОтгрузкаБезДокументов(МассивДокументов);
				Если ЗначениеЗаполнено(МассивОбъектовОтгрузкаБезДок) Тогда
					// Формируем вторую печатную форму (Отгрузка без документов)000026255
					ПФ_Отгрузка = Документы.РеализацияТоваровУслуг.СформироватьПечатнуюФормуНакладнаяОтгрузкаБезДокументов(МассивОбъектовОтгрузкаБезДок, ОбъектыПечати, ВывестиКомплектующие , ВывестиГТД, ВывестиКомплектовочныйЛист);

					//Чтобы последний док накладной не был с док отгрузкой на одной странице 000026255
					ИтоговыйТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
					
					// Добавляем вторую форму в итоговый документ 000026255
					ИтоговыйТабДокумент.Вывести(ПФ_Отгрузка);	
				КонецЕсли;
               //-- ASP_Спиряева 27.02.2025 000026255

				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				КомплектПечати.Имя,
				КомплектПечати.Представление,
				ИтоговыйТабДокумент);
			КонецЦикла;
		Иначе Сообщить("Для документа " + МассивОбъектов[0] + " не создана реализация! Печать расходной накладной с комплектующими невозможна!");
		КонецЕсли;
		
						
		//+ГТС добавляем вывод комплектовочного листа
		Если МассивДокументов.Количество() <> 0 Тогда
		КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
					КомплектПечатныхФорм,
					МассивОбъектов,
					"КомплектовочныйЛист");

		Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
				ВывестиКомплектующие = Ложь;
				ВывестиГТД = Ложь;
				ВывестиКомплектовочныйЛист=Истина;
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				КомплектПечати.Имя,
				КомплектПечати.Представление,
				Документы.РеализацияТоваровУслуг.Аль_СформироватьПечатнуюФормуНакладная(МассивДокументов, ОбъектыПечати, ВывестиКомплектующие , ВывестиГТД, ВывестиКомплектовочныйЛист));
		КонецЦикла;
		Иначе Сообщить("Для документа "+ МассивОбъектов[0] + " не создана реализация! Печать комплектовочного листа невозможна!");
		КонецЕсли;
		//-ГТС добавляем вывод комплектовочного листа
			
	//КонецЕсли;
	
	//ИмяМакета = "БланкЗаказа";	
	//ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));	
	//Если ТекущийКомплект.Количество() > 0 Тогда
		МассивДокументов = Новый Массив;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаНаТранспорт.Ссылка
		               |ИЗ
		               |	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
		               |ГДЕ
		               |	ЗаявкаНаТранспорт.ДокументОснование.Ссылка В(&ЗаказКлиента)" ;
		Запрос.УстановитьПараметр("ЗаказКлиента", МассивОбъектов); 
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДокументов.Вставить(0, Выборка.Ссылка);
		КонецЦикла;
		
		Если МассивДокументов.Количество() <> 0 Тогда
		//Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
		//	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КоллекцияПечатныхФорм, ИмяМакета, ИмяМакета, 1);//ASP_Dante 05/09/19СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
		//	ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
		//	ТаблицаСсылок.Свернуть("Ссылка");
		//	ТекущаяСтруктураТипов = Новый Соответствие;
		//	ТекущаяСтруктураТипов.Вставить("Документ.ЗаявкаНаТранспорт", МассивДокументов);
		//Иначе
		//	РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
		//	СтруктураТипов = Новый Соответствие;
		//	СтруктураТипов.Вставить("Документ.ЗаявкаНаТранспорт", МассивДокументов);
		//	ТекущаяСтруктураТипов = СтруктураТипов;
		//КонецЕсли;
		//		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, ТекущийКомплект[0].Представление, 
		//Документы.ЗаявкаНаТранспорт.ПечатьБланкаДоставки(МассивДокументов, ОбъектыПечати));
		КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
					КомплектПечатныхФорм,
					МассивОбъектов,
					"БланкЗаказа");
			//ПараметрыПечати.Вставить("ИмяФормы", "ЗаданиеНаОтбор");
			Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
				//++ ASP_Спиряева 27.02.2025 000026255 Добавила вторую форму для БланкЗаказа если есть ОтгрузкаБезДокументов  
				ИтоговыйТабДокумент = Документы.ЗаявкаНаТранспорт.ПечатьБланкаДоставки(МассивДокументов, ОбъектыПечати); 
				//Проверяем, есть ли объекты для второй формы  000026255
				МассивОбъектовОтгрузкаБезДок = Документы.ЗаявкаНаТранспорт.ПроверитьДокументыОтгрузкаБезДокументов(МассивДокументов);
				Если ЗначениеЗаполнено(МассивОбъектовОтгрузкаБезДок) Тогда
					// Формируем вторую печатную форму (Отгрузка без документов)000026255
					ПФ_Отгрузка = Документы.ЗаявкаНаТранспорт.ПечатьБланкаДоставкиОтгрузкаБезДокументов(МассивОбъектовОтгрузкаБезДок, ОбъектыПечати);
					//Чтобы последний док накладной не был с док отгрузкой на одной странице 000026255
					ИтоговыйТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 				
					// Добавляем вторую форму в итоговый документ 000026255
					ИтоговыйТабДокумент.Вывести(ПФ_Отгрузка);	
				КонецЕсли;
				//-- ASP_Спиряева 27.02.2025 000026255

				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				КомплектПечати.Имя,
				КомплектПечати.Представление,
				ИтоговыйТабДокумент);
			КонецЦикла;
		Иначе Сообщить("Для документа "+ МассивОбъектов[0] + " не создана заявка на транспорт! Печать бланка доставки невозможна!");
		КонецЕсли;
	//КонецЕсли;

	
#КонецОбласти	


	ИмяМакета = "ВнешняяПечатнаяФорма.УПД"; //ASP Mental 2018-11-13 +++
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,",ИмяМакета,Истина));	
	Если ТекущийКомплект.Количество() > 0 Тогда
		МассивДокументов = Новый Массив;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.ЗаказКлиента.Ссылка В(&ЗаказКлиента)" ;
		Запрос.УстановитьПараметр("ЗаказКлиента", МассивОбъектов); 
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДокументов.Вставить(0, Выборка.Ссылка);
		КонецЦикла;
		
		РегистрыСведений.НастройкиПечатиОбъектов.СформироватьКомплектВнешнихПечатныхФорм(
		"Документ.РеализацияТоваровУслуг",
		МассивДокументов,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати);
	Иначе
	РегистрыСведений.НастройкиПечатиОбъектов.СформироватьКомплектВнешнихПечатныхФорм(
		"Документ.ЗаказКлиента",
		МассивОбъектов,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати);
	КонецЕсли;//ASP_Dante 31/08/19

#КонецВставки
	ЗаказКлиентаЛокализация.СформироватьКомплектПечатныхФорм(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	КомплектПечатныхФорм);

КонецФункции

&ИзменениеИКонтроль("Печать")
Процедура асп_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДокументов") Тогда
		КоллекцияПечатныхФорм.Очистить();
		СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати);
	#Вставка
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПоЦиклу") Тогда
		ПечатьЗаказаПоЦиклу(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	#КонецВставки
	КонецЕсли;


	ЗаказКлиентаЛокализация.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);

КонецПроцедуры

Процедура ПечатьЗаказаПоЦиклу(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	ПечатнаяФормаНаВывод = КоллекцияПечатныхФорм[0];
	Макет = УправлениеПечатью.МакетПечатнойФормы("ПФ_2988ddd6-6d78-4efb-86d8-3ffbd1902f31", "ru"); //Хардкодом, т.к. непонятно откуда взять это
	КодЯзыка = "ru";
	ОфисныйДокумент = УправлениеПечатью.СформироватьОфисныйДокумент(Макет, МассивОбъектов, ОбъектыПечати, КодЯзыка, новый Структура, "ЗаказПоЦиклу");
	ПечатнаяФормаНаВывод.ОфисныеДокументы = ОфисныйДокумент;
	
КонецПроцедуры

//ASP+++

//ASP+++
Функция ПолучитьДанныеДляПечатнойФормыСчетаНаОплатуГТС_Неиспользуется(ПараметрыПечати, МассивОбъектов) Экспорт
	
	ВыводитьСкидки = Истина;
	Попытка
		ВыводитьСкидки = ПараметрыПечати["ВыводитьСкидки"];
	Исключение
	КонецПопытки;	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	ЕСТЬNULL(Документы.БанковскийСчет.Владелец, Документы.Организация) КАК Организация,
	|	Документы.Организация КАК ОрганизацияПоставщик,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Контрагент КАК Контрагент,
	|	Документы.БанковскийСчет КАК БанковскийСчет,
	|	Документы.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	Документы.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Документы.Валюта КАК Валюта,
	|	Документы.Менеджер.ФизическоеЛицо.Наименование КАК Менеджер,
	|	Документы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	&ВыводитьСкидки КАК ВыводитьСкидки,
	|	Документы.СуммаДокумента КАК СуммаКВозврату,
	|	ЛОЖЬ КАК ЧастичнаяОплата,
	|	"""" КАК НазначениеПлатежа,
	|	100 КАК ПроцентОплаты,
	|	Документы.СуммаДокумента КАК СуммаДокумента,
	|	ЛОЖЬ КАК СчетКВозврату
	|ИЗ
	|	Документ.ЗаказКлиента КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	|	ЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа
	|ИЗ
	|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.Код КАК Код,
	|	Товары.Номенклатура.Артикул КАК Артикул,
	|	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка.ЕдиницаИзмерения)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	Товары.КоличествоУпаковок КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьСкидки
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ Товары.Сумма / Товары.КоличествоУпаковок
	|	КОНЕЦ КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Товары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Товары.Упаковка.Знаменатель, 1) = 0
	|				ИЛИ ЕСТЬNULL(Товары.Упаковка.Числитель, 1) / ЕСТЬNULL(Товары.Упаковка.Знаменатель, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Товары.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаСкидки,
	|	Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|	Товары.Содержание КАК Содержание,
|// {{ ASP_DavydenkoDV 13.11.2019 12:08
	|	Товары.НоменклатураНабора,  // {{ ASP_DavydenkoDV 28.08.2019 16:10 }}
	|	Товары.ХарактеристикаНабора  // {{ ASP_DavydenkoDV 28.08.2019 16:10 }}
|// }} ASP_DavydenkoDV 13.11.2019 12:08
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|	И Товары.Отменено = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	// tise добавил 2010-12-24
	Запрос.УстановитьПараметр("ВыводитьСкидки", ВыводитьСкидки);
	// /tise добавил 2010-12-24
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[0]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[1]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[2]);
	СтруктураДанныхДляПечати.Вставить("ВыводитьСкидки", ВыводитьСкидки);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции
//ASP---

//ASP bvd 13/03/20++
//Доработано в выше стоящей функции суммирование и сортировка
//при соответствующей настройки вывода в печатные формы
Функция ПолучитьДанныеДляПечатнойФормыСчетаНаОплатуГТС(ПараметрыПечати, МассивОбъектов) Экспорт
	
	ВыводитьСкидки = Истина;
	Попытка
		ВыводитьСкидки = ПараметрыПечати["ВыводитьСкидки"];
	Исключение
	КонецПопытки;	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	ЕСТЬNULL(Документы.БанковскийСчет.Владелец, Документы.Организация) КАК Организация,
	|	Документы.Организация КАК ОрганизацияПоставщик,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	Документы.Организация.Префикс КАК Префикс,
	|	Документы.Контрагент КАК Контрагент,
	|	Документы.БанковскийСчет КАК БанковскийСчет,
	|	Документы.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	Документы.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Документы.Валюта КАК Валюта,
	|	Документы.Менеджер.ФизическоеЛицо.Наименование КАК Менеджер,
	|	Документы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	&ВыводитьСкидки КАК ВыводитьСкидки,
	|	Документы.СуммаДокумента КАК СуммаКВозврату,
	|	ЛОЖЬ КАК ЧастичнаяОплата,
	|	"""" КАК НазначениеПлатежа,
	|	100 КАК ПроцентОплаты,
	|	Документы.СуммаДокумента КАК СуммаДокумента,  
	|	Документы.Подразделение КАК Подразделение,
	|	ЛОЖЬ КАК СчетКВозврату,  
	// +++ ASP_Мочалина 13.06.24  000023395 Добавление реквизитов для формирования платежной ссылки СБП.
	|	Документы.ИдентификаторПлатежа КАК ИдентификаторПлатежа, 
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторБанков.БИКРКЦ.Наименование, """")
	|	КОНЕЦ КАК НаименованиеРКЦБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторБанковКорреспондентовРФ.БИКРКЦ.Наименование, """")
	|	КОНЕЦ КАК НаименованиеРКЦБанкаДляРасчетов  
	// --- ASP_Мочалина 13.06.24  000023395 Добавление реквизитов для формирования платежной ссылки СБП.
	|ИЗ
	|	Документ.ЗаказКлиента КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанковКорреспондентовРФ
	|		ПО Документы.БанковскийСчет.БанкДляРасчетов = КлассификаторБанковКорреспондентовРФ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО Документы.БанковскийСчет.Банк = КлассификаторБанков.Ссылка
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	|	ЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа
	|ИЗ
	|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.Код КАК Код,
	|	Товары.Номенклатура.Артикул КАК Артикул,
	|	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	Товары.КоличествоУпаковок КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВыводитьСкидки
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ Товары.Сумма / Товары.КоличествоУпаковок
	|	КОНЕЦ КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Товары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Товары.Упаковка.Знаменатель, 1) = 0
	|				ИЛИ ЕСТЬNULL(Товары.Упаковка.Числитель, 1) / ЕСТЬNULL(Товары.Упаковка.Знаменатель, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Товары.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаСкидки,
	|	Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|	Товары.Содержание КАК Содержание,
	|	Товары.НоменклатураНабора КАК НоменклатураНабора,
	|	Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	Товары.Ссылка.ВариантПечатиНаборов КАК ВариантПечатиНаборов
	|ПОМЕСТИТЬ ОсновнаяТаблица
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|	И Товары.Отменено = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновнаяТаблица.Ссылка КАК Ссылка,
	|	ОсновнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ОсновнаяТаблица.Номенклатура КАК Номенклатура,
	|	ОсновнаяТаблица.Код КАК Код,
	|	ОсновнаяТаблица.Артикул КАК Артикул,
	|	ОсновнаяТаблица.НаименованиеПолное КАК НаименованиеПолное,
	|	ОсновнаяТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОсновнаяТаблица.Количество КАК Количество,
	|	ОсновнаяТаблица.Цена КАК Цена,
	|	ОсновнаяТаблица.Сумма КАК Сумма,
	|	ОсновнаяТаблица.СтавкаНДС КАК СтавкаНДС,
	|	ОсновнаяТаблица.СуммаНДС КАК СуммаНДС,
	|	ОсновнаяТаблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ОсновнаяТаблица.Характеристика КАК Характеристика,
	|	ОсновнаяТаблица.Упаковка КАК Упаковка,
	|	ОсновнаяТаблица.СуммаСкидки КАК СуммаСкидки,
	|	ОсновнаяТаблица.СуммаБезСкидки КАК СуммаБезСкидки,
	|	ОсновнаяТаблица.Содержание КАК Содержание,
	|	ОсновнаяТаблица.НоменклатураНабора КАК НоменклатураНабора,
	|	ОсновнаяТаблица.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ОсновнаяТаблица.ВариантПечатиНаборов КАК ВариантПечатиНаборов
	|ПОМЕСТИТЬ ТаблицаСПризнакомПечати
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Ссылка КАК Ссылка,
	|		Товары.НомерСтроки КАК НомерСтроки,
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.Номенклатура.Код КАК Код,
	|		Товары.Номенклатура.Артикул КАК Артикул,
	|		Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Товары.Упаковка)
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		Товары.КоличествоУпаковок КАК Количество,
	|		ВЫБОР
	|			КОГДА &ВыводитьСкидки
	|				ТОГДА Товары.Цена
	|			ИНАЧЕ Товары.Сумма / Товары.КоличествоУпаковок
	|		КОНЕЦ КАК Цена,
	|		Товары.Сумма КАК Сумма,
	|		Товары.СтавкаНДС КАК СтавкаНДС,
	|		Товары.СуммаНДС КАК СуммаНДС,
	|		Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|		Товары.Характеристика КАК Характеристика,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Товары.Упаковка.Знаменатель, 1) = 0
	|					ИЛИ ЕСТЬNULL(Товары.Упаковка.Числитель, 1) / ЕСТЬNULL(Товары.Упаковка.Знаменатель, 1) = 1
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Товары.Упаковка.Наименование
	|		КОНЕЦ КАК Упаковка,
	|		Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаСкидки,
	|		Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|		Товары.Содержание КАК Содержание,
	|		Товары.НоменклатураНабора КАК НоменклатураНабора,
	|		Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|		Товары.Ссылка.ВариантПечатиНаборов КАК ВариантПечатиНаборов
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК Товары
	|	ГДЕ
	|		Товары.Ссылка В(&МассивОбъектов)
	|		И Товары.Отменено = ЛОЖЬ) КАК ОсновнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСПризнакомПечати.Номенклатура КАК Номенклатура,
	|	СУММА(ТаблицаСПризнакомПечати.Количество) КАК Количество,
	|	ТаблицаСПризнакомПечати.Код КАК Код,
	|	ТаблицаСПризнакомПечати.Артикул КАК Артикул,
	|	ТаблицаСПризнакомПечати.Ссылка КАК Ссылка,
	|	ТаблицаСПризнакомПечати.НаименованиеПолное КАК НаименованиеПолное,
	|	ТаблицаСПризнакомПечати.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаСПризнакомПечати.Цена КАК Цена,
	|	СУММА(ТаблицаСПризнакомПечати.Сумма) КАК Сумма,
	|	ТаблицаСПризнакомПечати.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаСПризнакомПечати.СуммаНДС) КАК СуммаНДС,
	|	NULL КАК ДатаОтгрузки,
	|	ТаблицаСПризнакомПечати.Характеристика КАК Характеристика,
	|	ТаблицаСПризнакомПечати.Упаковка КАК Упаковка,
	|	СУММА(ТаблицаСПризнакомПечати.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(ТаблицаСПризнакомПечати.СуммаБезСкидки) КАК СуммаБезСкидки,
	|	ТаблицаСПризнакомПечати.Содержание КАК Содержание,
	|	ТаблицаСПризнакомПечати.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НоменклатураНабора,
	|	МИНИМУМ(ТаблицаСПризнакомПечати.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ТаблицаСПризнакомПечати КАК ТаблицаСПризнакомПечати
	|ГДЕ
	|	(ТаблицаСПризнакомПечати.ВариантПечатиНаборов = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие)
	|			ИЛИ ТаблицаСПризнакомПечати.ВариантПечатиНаборов ЕСТЬ NULL)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСПризнакомПечати.Номенклатура,
	|	ТаблицаСПризнакомПечати.Код,
	|	ТаблицаСПризнакомПечати.Артикул,
	|	ТаблицаСПризнакомПечати.Ссылка,
	|	ТаблицаСПризнакомПечати.НаименованиеПолное,
	|	ТаблицаСПризнакомПечати.ЕдиницаИзмерения,
	|	ТаблицаСПризнакомПечати.СтавкаНДС,
	|	ТаблицаСПризнакомПечати.Характеристика,
	|	ТаблицаСПризнакомПечати.Упаковка,
	|	ТаблицаСПризнакомПечати.Содержание,
	|	ТаблицаСПризнакомПечати.ХарактеристикаНабора,
	|	ТаблицаСПризнакомПечати.Цена
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСПризнакомПечати.Номенклатура,
	|	ТаблицаСПризнакомПечати.Количество,
	|	ТаблицаСПризнакомПечати.Код,
	|	ТаблицаСПризнакомПечати.Артикул,
	|	ТаблицаСПризнакомПечати.Ссылка,
	|	ТаблицаСПризнакомПечати.НаименованиеПолное,
	|	ТаблицаСПризнакомПечати.ЕдиницаИзмерения,
	|	ТаблицаСПризнакомПечати.Цена,
	|	ТаблицаСПризнакомПечати.Сумма,
	|	ТаблицаСПризнакомПечати.СтавкаНДС,
	|	ТаблицаСПризнакомПечати.СуммаНДС,
	|	ТаблицаСПризнакомПечати.ДатаОтгрузки,
	|	ТаблицаСПризнакомПечати.Характеристика,
	|	ТаблицаСПризнакомПечати.Упаковка,
	|	ТаблицаСПризнакомПечати.СуммаСкидки,
	|	ТаблицаСПризнакомПечати.СуммаБезСкидки,
	|	ТаблицаСПризнакомПечати.Содержание,
	|	ТаблицаСПризнакомПечати.ХарактеристикаНабора,
	|	ТаблицаСПризнакомПечати.НоменклатураНабора,
	|	ТаблицаСПризнакомПечати.НомерСтроки
	|ИЗ
	|	ТаблицаСПризнакомПечати КАК ТаблицаСПризнакомПечати
	|ГДЕ
	|	ТаблицаСПризнакомПечати.ВариантПечатиНаборов <> ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНабора,
	|	НомерСтроки";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	// tise добавил 2010-12-24
	Запрос.УстановитьПараметр("ВыводитьСкидки", ВыводитьСкидки);
	// /tise добавил 2010-12-24
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[0]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[1]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[4]);
	СтруктураДанныхДляПечати.Вставить("ВыводитьСкидки", ВыводитьСкидки);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции
//ASP bvd 13/03/20--

Функция ЗапретРезервирования(Номенклатура, Склад)
	
	//ASP_Dante 15/10/19
	Если (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ASP_ЗапретРезервирования")) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если Склад.ASP_ЗапретРезервирования И Склад.ASP_Номенклатура.Количество() = 0 Тогда
		Возврат Истина;
	ИначеЕсли Склад.ASP_ЗапретРезервирования Тогда
		Строка = Склад.ASP_Номенклатура.Найти(Номенклатура, "Номенклатура");
		Возврат Не Строка = Неопределено;
	КонецЕсли;		
	
	Возврат Ложь;
	//ASP_Dante 15/10/19
	
КонецФункции
//ASP---

Функция ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ОбеспечениеЗаказов";
	Регистры.Вставить("ОбеспечениеЗаказов"); //ASP_Crow 25.03.2024 Возвращаем проведение по обеспечению заказов
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
		// Формирование потребности
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период                                КАК Период,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	&Назначение                            КАК Назначение,
		|	ТаблицаТовары.Количество               КАК Потребность,
		|	ТаблицаТовары.Количество               КАК КЗаказу,
		|	0                                      КАК НаличиеПодЗаказ
		|
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|	И НЕ ТаблицаТовары.Отменено
		|
		|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры В(
		|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|
		|	И ТаблицаТовары.ВариантОбеспечения В(
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению),
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
		|
		|	И &Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт))
		|	И ТаблицаТовары.Обособленно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Закрытие потребности
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период                                КАК Период,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	&Назначение                            КАК Назначение,
		|	ТаблицаТовары.Количество               КАК Потребность,
		|	0                                      КАК КЗаказу,
		|	ТаблицаТовары.Количество               КАК НаличиеПодЗаказ
		|
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|	И НЕ ТаблицаТовары.Отменено
		|
		|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры В(
		|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|
		|	И ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
		|
		|	И &Статус В(
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт))
		|	И ТаблицаТовары.Обособленно";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаказовКОбеспечению() Экспорт
	//ASP_Crow 04.05.2026 000029567 В расширение
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.Ссылка                КАК Заказ,
	|	Т.КодСтроки             КАК КодСтроки,
	|	Т.НомерСтроки           КАК НомерСтроки,
	|	0                       КАК НомерСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО            КАК Продукция,
	|	НЕОПРЕДЕЛЕНО            КАК Этап,
	|	0                       КАК ЭтапПорядок,
	|	
	|	Т.Номенклатура          КАК Номенклатура,
	|	Т.Характеристика        КАК Характеристика,
	|	Т.Склад                 КАК Склад,
	|	ТаблицаДокумента.Назначение     КАК Назначение,
	|	ТаблицаДокумента.Подразделение  КАК Подразделение,
	|	
	|	Т.ВариантОбеспечения    КАК ВариантОбеспечения,
	|	Т.ДатаОтгрузки          КАК ДатаОтгрузки,
	|	
	|	Т.Упаковка              КАК Упаковка,
	|	Т.Количество            КАК Количество,
	|	
	|	ТаблицаДокумента.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	|	ТаблицаДокумента.НеОтгружатьЧастями   КАК НеОтгружатьЧастями,
	|	ТаблицаДокумента.Дата                 КАК Дата,
	|	ТаблицаДокумента.Партнер              КАК Партнер,
	|	ТаблицаДокумента.Менеджер             КАК Менеджер,
	|	ТаблицаДокумента.Статус               КАК Статус,
	|	ИСТИНА                        КАК СтатусИспользуется
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ТаблицаДокумента
	|		ПО Т.Ссылка = ТаблицаДокумента.Ссылка
	|ГДЕ
	|	Т.Ссылка В (&Заказы)
	|	И ТаблицаДокумента.Проведен
	|	И Т.Отменено = ЛОЖЬ
	|	И ТаблицаДокумента.ПометкаУдаления = ЛОЖЬ
	|	И Т.ВариантОбеспечения В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению  ),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.УдалитьОбособленно),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	|	)";
	
	Возврат ТекстЗапроса;
	
КонецФункции
